remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
/**
 * \file
 *
 * \brief Component description for GPIO
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_GPIO_COMPONENT_
#define _SAMB11_GPIO_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR GPIO */
/* ========================================================================== */
/** \addtogroup SAMB11_GPIO GPIO Controller 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define GPIO_G1234
#define REV_GPIO                         0x100

/* -------- GPIO_DATA : (GPIO Offset: 0x00) (R/W 16) Data Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Read = Sampled at Pin : Write = To Output Data Register */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_DATA_OFFSET                    0x00                                          /**<  (GPIO_DATA) Data Value  Offset */
#define GPIO_DATA_RESETVALUE                0x00u                                         /**<  (GPIO_DATA) Data Value  Reset Value */

#define GPIO_DATA_VALUE_Pos                 0                                              /**< (GPIO_DATA) Read = Sampled at Pin : Write = To Output Data Register Position */
#define GPIO_DATA_VALUE_Msk                 (0xFFFFu << GPIO_DATA_VALUE_Pos)               /**< (GPIO_DATA) Read = Sampled at Pin : Write = To Output Data Register Mask */
#define GPIO_DATA_VALUE(value)              (GPIO_DATA_VALUE_Msk & ((value) << GPIO_DATA_VALUE_Pos))
#define GPIO_DATA_MASK                      0xFFFFu                                        /**< \deprecated (GPIO_DATA) Register MASK  (Use GPIO_DATA_Msk instead)  */
#define GPIO_DATA_Msk                       0xFFFFu                                        /**< (GPIO_DATA) Register Mask  */

/* -------- GPIO_DATAOUT : (GPIO Offset: 0x04) (R/W 16) Data Output Register Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Read = Current Value of Data Output Register : Write = To Output Data Register */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_DATAOUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_DATAOUT_OFFSET                 0x04                                          /**<  (GPIO_DATAOUT) Data Output Register Value  Offset */
#define GPIO_DATAOUT_RESETVALUE             0x00u                                         /**<  (GPIO_DATAOUT) Data Output Register Value  Reset Value */

#define GPIO_DATAOUT_VALUE_Pos              0                                              /**< (GPIO_DATAOUT) Read = Current Value of Data Output Register : Write = To Output Data Register Position */
#define GPIO_DATAOUT_VALUE_Msk              (0xFFFFu << GPIO_DATAOUT_VALUE_Pos)            /**< (GPIO_DATAOUT) Read = Current Value of Data Output Register : Write = To Output Data Register Mask */
#define GPIO_DATAOUT_VALUE(value)           (GPIO_DATAOUT_VALUE_Msk & ((value) << GPIO_DATAOUT_VALUE_Pos))
#define GPIO_DATAOUT_MASK                   0xFFFFu                                        /**< \deprecated (GPIO_DATAOUT) Register MASK  (Use GPIO_DATAOUT_Msk instead)  */
#define GPIO_DATAOUT_Msk                    0xFFFFu                                        /**< (GPIO_DATAOUT) Register Mask  */

/* -------- GPIO_OUTENSET : (GPIO Offset: 0x10) (R/W 16) Output Enable Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to set the output enable bit     */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_OUTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_OUTENSET_OFFSET                0x10                                          /**<  (GPIO_OUTENSET) Output Enable Set  Offset */
#define GPIO_OUTENSET_RESETVALUE            0x00u                                         /**<  (GPIO_OUTENSET) Output Enable Set  Reset Value */

#define GPIO_OUTENSET_VALUE_Pos             0                                              /**< (GPIO_OUTENSET) Write 1 to set the output enable bit Position */
#define GPIO_OUTENSET_VALUE_Msk             (0xFFFFu << GPIO_OUTENSET_VALUE_Pos)           /**< (GPIO_OUTENSET) Write 1 to set the output enable bit Mask */
#define GPIO_OUTENSET_VALUE(value)          (GPIO_OUTENSET_VALUE_Msk & ((value) << GPIO_OUTENSET_VALUE_Pos))
#define GPIO_OUTENSET_MASK                  0xFFFFu                                        /**< \deprecated (GPIO_OUTENSET) Register MASK  (Use GPIO_OUTENSET_Msk instead)  */
#define GPIO_OUTENSET_Msk                   0xFFFFu                                        /**< (GPIO_OUTENSET) Register Mask  */

/* -------- GPIO_OUTENCLR : (GPIO Offset: 0x14) (R/W 16) Output Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to clear the output enable bit   */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_OUTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_OUTENCLR_OFFSET                0x14                                          /**<  (GPIO_OUTENCLR) Output Enable Clear  Offset */
#define GPIO_OUTENCLR_RESETVALUE            0x00u                                         /**<  (GPIO_OUTENCLR) Output Enable Clear  Reset Value */

