remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
#define GPIO_OUTENCLR_VALUE_Pos             0                                              /**< (GPIO_OUTENCLR) Write 1 to clear the output enable bit Position */
#define GPIO_OUTENCLR_VALUE_Msk             (0xFFFFu << GPIO_OUTENCLR_VALUE_Pos)           /**< (GPIO_OUTENCLR) Write 1 to clear the output enable bit Mask */
#define GPIO_OUTENCLR_VALUE(value)          (GPIO_OUTENCLR_VALUE_Msk & ((value) << GPIO_OUTENCLR_VALUE_Pos))
#define GPIO_OUTENCLR_MASK                  0xFFFFu                                        /**< \deprecated (GPIO_OUTENCLR) Register MASK  (Use GPIO_OUTENCLR_Msk instead)  */
#define GPIO_OUTENCLR_Msk                   0xFFFFu                                        /**< (GPIO_OUTENCLR) Register Mask  */

/* -------- GPIO_INTENSET : (GPIO Offset: 0x20) (R/W 16) Interrupt Enable Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to set the enable bit            */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTENSET_OFFSET                0x20                                          /**<  (GPIO_INTENSET) Interrupt Enable Set  Offset */
#define GPIO_INTENSET_RESETVALUE            0x00u                                         /**<  (GPIO_INTENSET) Interrupt Enable Set  Reset Value */

#define GPIO_INTENSET_VALUE_Pos             0                                              /**< (GPIO_INTENSET) Write 1 to set the enable bit Position */
#define GPIO_INTENSET_VALUE_Msk             (0xFFFFu << GPIO_INTENSET_VALUE_Pos)           /**< (GPIO_INTENSET) Write 1 to set the enable bit Mask */
#define GPIO_INTENSET_VALUE(value)          (GPIO_INTENSET_VALUE_Msk & ((value) << GPIO_INTENSET_VALUE_Pos))
#define GPIO_INTENSET_MASK                  0xFFFFu                                        /**< \deprecated (GPIO_INTENSET) Register MASK  (Use GPIO_INTENSET_Msk instead)  */
#define GPIO_INTENSET_Msk                   0xFFFFu                                        /**< (GPIO_INTENSET) Register Mask  */

/* -------- GPIO_INTENCLR : (GPIO Offset: 0x24) (R/W 16) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to clear the enable bit          */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTENCLR_OFFSET                0x24                                          /**<  (GPIO_INTENCLR) Interrupt Enable Clear  Offset */
#define GPIO_INTENCLR_RESETVALUE            0x00u                                         /**<  (GPIO_INTENCLR) Interrupt Enable Clear  Reset Value */

#define GPIO_INTENCLR_VALUE_Pos             0                                              /**< (GPIO_INTENCLR) Write 1 to clear the enable bit Position */
#define GPIO_INTENCLR_VALUE_Msk             (0xFFFFu << GPIO_INTENCLR_VALUE_Pos)           /**< (GPIO_INTENCLR) Write 1 to clear the enable bit Mask */
#define GPIO_INTENCLR_VALUE(value)          (GPIO_INTENCLR_VALUE_Msk & ((value) << GPIO_INTENCLR_VALUE_Pos))
#define GPIO_INTENCLR_MASK                  0xFFFFu                                        /**< \deprecated (GPIO_INTENCLR) Register MASK  (Use GPIO_INTENCLR_Msk instead)  */
#define GPIO_INTENCLR_Msk                   0xFFFFu                                        /**< (GPIO_INTENCLR) Register Mask  */

/* -------- GPIO_INTTYPESET : (GPIO Offset: 0x28) (R/W 16) Interrupt Type Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 for edge                         */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTTYPESET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTTYPESET_OFFSET              0x28                                          /**<  (GPIO_INTTYPESET) Interrupt Type Set  Offset */
#define GPIO_INTTYPESET_RESETVALUE          0x00u                                         /**<  (GPIO_INTTYPESET) Interrupt Type Set  Reset Value */

#define GPIO_INTTYPESET_VALUE_Pos           0                                              /**< (GPIO_INTTYPESET) Write 1 for edge Position */
#define GPIO_INTTYPESET_VALUE_Msk           (0xFFFFu << GPIO_INTTYPESET_VALUE_Pos)         /**< (GPIO_INTTYPESET) Write 1 for edge Mask */
#define GPIO_INTTYPESET_VALUE(value)        (GPIO_INTTYPESET_VALUE_Msk & ((value) << GPIO_INTTYPESET_VALUE_Pos))
#define GPIO_INTTYPESET_MASK                0xFFFFu                                        /**< \deprecated (GPIO_INTTYPESET) Register MASK  (Use GPIO_INTTYPESET_Msk instead)  */
#define GPIO_INTTYPESET_Msk                 0xFFFFu                                        /**< (GPIO_INTTYPESET) Register Mask  */

/* -------- GPIO_INTTYPECLR : (GPIO Offset: 0x2c) (R/W 16) Interrupt Type Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to clear the interrupt type      */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTTYPECLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTTYPECLR_OFFSET              0x2C                                          /**<  (GPIO_INTTYPECLR) Interrupt Type Clear  Offset */
#define GPIO_INTTYPECLR_RESETVALUE          0x00u                                         /**<  (GPIO_INTTYPECLR) Interrupt Type Clear  Reset Value */

