remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
#define GPIO_INTTYPECLR_VALUE_Pos           0                                              /**< (GPIO_INTTYPECLR) Write 1 to clear the interrupt type Position */
#define GPIO_INTTYPECLR_VALUE_Msk           (0xFFFFu << GPIO_INTTYPECLR_VALUE_Pos)         /**< (GPIO_INTTYPECLR) Write 1 to clear the interrupt type Mask */
#define GPIO_INTTYPECLR_VALUE(value)        (GPIO_INTTYPECLR_VALUE_Msk & ((value) << GPIO_INTTYPECLR_VALUE_Pos))
#define GPIO_INTTYPECLR_MASK                0xFFFFu                                        /**< \deprecated (GPIO_INTTYPECLR) Register MASK  (Use GPIO_INTTYPECLR_Msk instead)  */
#define GPIO_INTTYPECLR_Msk                 0xFFFFu                                        /**< (GPIO_INTTYPECLR) Register Mask  */

/* -------- GPIO_INTPOLSET : (GPIO Offset: 0x30) (R/W 16) Polarity-level, edge IRQ Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 for HIGH level or rising edge    */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTPOLSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTPOLSET_OFFSET               0x30                                          /**<  (GPIO_INTPOLSET) Polarity-level, edge IRQ Configuration  Offset */
#define GPIO_INTPOLSET_RESETVALUE           0x00u                                         /**<  (GPIO_INTPOLSET) Polarity-level, edge IRQ Configuration  Reset Value */

#define GPIO_INTPOLSET_VALUE_Pos            0                                              /**< (GPIO_INTPOLSET) Write 1 for HIGH level or rising edge Position */
#define GPIO_INTPOLSET_VALUE_Msk            (0xFFFFu << GPIO_INTPOLSET_VALUE_Pos)          /**< (GPIO_INTPOLSET) Write 1 for HIGH level or rising edge Mask */
#define GPIO_INTPOLSET_VALUE(value)         (GPIO_INTPOLSET_VALUE_Msk & ((value) << GPIO_INTPOLSET_VALUE_Pos))
#define GPIO_INTPOLSET_MASK                 0xFFFFu                                        /**< \deprecated (GPIO_INTPOLSET) Register MASK  (Use GPIO_INTPOLSET_Msk instead)  */
#define GPIO_INTPOLSET_Msk                  0xFFFFu                                        /**< (GPIO_INTPOLSET) Register Mask  */

/* -------- GPIO_INTPOLCLR : (GPIO Offset: 0x34) (R/W 16) IRQ Configuration Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to Clear Interrupt Polarity Bit  */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTPOLCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTPOLCLR_OFFSET               0x34                                          /**<  (GPIO_INTPOLCLR) IRQ Configuration Clear  Offset */
#define GPIO_INTPOLCLR_RESETVALUE           0x00u                                         /**<  (GPIO_INTPOLCLR) IRQ Configuration Clear  Reset Value */

#define GPIO_INTPOLCLR_VALUE_Pos            0                                              /**< (GPIO_INTPOLCLR) Write 1 to Clear Interrupt Polarity Bit Position */
#define GPIO_INTPOLCLR_VALUE_Msk            (0xFFFFu << GPIO_INTPOLCLR_VALUE_Pos)          /**< (GPIO_INTPOLCLR) Write 1 to Clear Interrupt Polarity Bit Mask */
#define GPIO_INTPOLCLR_VALUE(value)         (GPIO_INTPOLCLR_VALUE_Msk & ((value) << GPIO_INTPOLCLR_VALUE_Pos))
#define GPIO_INTPOLCLR_MASK                 0xFFFFu                                        /**< \deprecated (GPIO_INTPOLCLR) Register MASK  (Use GPIO_INTPOLCLR_Msk instead)  */
#define GPIO_INTPOLCLR_Msk                  0xFFFFu                                        /**< (GPIO_INTPOLCLR) Register Mask  */

/* -------- GPIO_INTSTATUSCLEAR : (GPIO Offset: 0x38) (R/W 16) Interrupt Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t VALUE:16;                  /**< bit:  0..15  Write 1 to Clear Interrupt               */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} GPIO_INTSTATUSCLEAR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_INTSTATUSCLEAR_OFFSET          0x38                                          /**<  (GPIO_INTSTATUSCLEAR) Interrupt Status  Offset */
#define GPIO_INTSTATUSCLEAR_RESETVALUE      0x00u                                         /**<  (GPIO_INTSTATUSCLEAR) Interrupt Status  Reset Value */

#define GPIO_INTSTATUSCLEAR_VALUE_Pos       0                                              /**< (GPIO_INTSTATUSCLEAR) Write 1 to Clear Interrupt Position */
#define GPIO_INTSTATUSCLEAR_VALUE_Msk       (0xFFFFu << GPIO_INTSTATUSCLEAR_VALUE_Pos)     /**< (GPIO_INTSTATUSCLEAR) Write 1 to Clear Interrupt Mask */
#define GPIO_INTSTATUSCLEAR_VALUE(value)    (GPIO_INTSTATUSCLEAR_VALUE_Msk & ((value) << GPIO_INTSTATUSCLEAR_VALUE_Pos))
#define GPIO_INTSTATUSCLEAR_MASK            0xFFFFu                                        /**< \deprecated (GPIO_INTSTATUSCLEAR) Register MASK  (Use GPIO_INTSTATUSCLEAR_Msk instead)  */
#define GPIO_INTSTATUSCLEAR_Msk             0xFFFFu                                        /**< (GPIO_INTSTATUSCLEAR) Register Mask  */

/* -------- GPIO_PID4 : (GPIO Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP106 C Code                            */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID4_OFFSET                    0xFD0                                         /**<  (GPIO_PID4) Peripheral ID Register 4  Offset */
#define GPIO_PID4_RESETVALUE                0x04u                                         /**<  (GPIO_PID4) Peripheral ID Register 4  Reset Value */

