remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
#define GPIO_PID4_JEP106_C_CODE_Pos         0                                              /**< (GPIO_PID4) JEP106 C Code Position */
#define GPIO_PID4_JEP106_C_CODE_Msk         (0xFu << GPIO_PID4_JEP106_C_CODE_Pos)          /**< (GPIO_PID4) JEP106 C Code Mask */
#define GPIO_PID4_JEP106_C_CODE(value)      (GPIO_PID4_JEP106_C_CODE_Msk & ((value) << GPIO_PID4_JEP106_C_CODE_Pos))
#define GPIO_PID4_BLOCK_COUNT_Pos           4                                              /**< (GPIO_PID4) Block Count Position */
#define GPIO_PID4_BLOCK_COUNT_Msk           (0xFu << GPIO_PID4_BLOCK_COUNT_Pos)            /**< (GPIO_PID4) Block Count Mask */
#define GPIO_PID4_BLOCK_COUNT(value)        (GPIO_PID4_BLOCK_COUNT_Msk & ((value) << GPIO_PID4_BLOCK_COUNT_Pos))
#define GPIO_PID4_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID4) Register MASK  (Use GPIO_PID4_Msk instead)  */
#define GPIO_PID4_Msk                       0xFFu                                          /**< (GPIO_PID4) Register Mask  */

/* -------- GPIO_PID5 : (GPIO Offset: 0xfd4) (R/ 8) Peripheral ID Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PID5:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID5_OFFSET                    0xFD4                                         /**<  (GPIO_PID5) Peripheral ID Register 5  Offset */
#define GPIO_PID5_RESETVALUE                0x00u                                         /**<  (GPIO_PID5) Peripheral ID Register 5  Reset Value */

#define GPIO_PID5_PID5_Pos                  0                                              /**< (GPIO_PID5)  Position */
#define GPIO_PID5_PID5_Msk                  (0xFFu << GPIO_PID5_PID5_Pos)                  /**< (GPIO_PID5)  Mask */
#define GPIO_PID5_PID5(value)               (GPIO_PID5_PID5_Msk & ((value) << GPIO_PID5_PID5_Pos))
#define GPIO_PID5_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID5) Register MASK  (Use GPIO_PID5_Msk instead)  */
#define GPIO_PID5_Msk                       0xFFu                                          /**< (GPIO_PID5) Register Mask  */

/* -------- GPIO_PID6 : (GPIO Offset: 0xfd8) (R/ 8) Peripheral ID Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PID6:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID6_OFFSET                    0xFD8                                         /**<  (GPIO_PID6) Peripheral ID Register 6  Offset */
#define GPIO_PID6_RESETVALUE                0x00u                                         /**<  (GPIO_PID6) Peripheral ID Register 6  Reset Value */

#define GPIO_PID6_PID6_Pos                  0                                              /**< (GPIO_PID6)  Position */
#define GPIO_PID6_PID6_Msk                  (0xFFu << GPIO_PID6_PID6_Pos)                  /**< (GPIO_PID6)  Mask */
#define GPIO_PID6_PID6(value)               (GPIO_PID6_PID6_Msk & ((value) << GPIO_PID6_PID6_Pos))
#define GPIO_PID6_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID6) Register MASK  (Use GPIO_PID6_Msk instead)  */
#define GPIO_PID6_Msk                       0xFFu                                          /**< (GPIO_PID6) Register Mask  */

/* -------- GPIO_PID7 : (GPIO Offset: 0xfdc) (R/ 8) Peripheral ID Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PID7:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID7_OFFSET                    0xFDC                                         /**<  (GPIO_PID7) Peripheral ID Register 7  Offset */
#define GPIO_PID7_RESETVALUE                0x00u                                         /**<  (GPIO_PID7) Peripheral ID Register 7  Reset Value */

#define GPIO_PID7_PID7_Pos                  0                                              /**< (GPIO_PID7)  Position */
#define GPIO_PID7_PID7_Msk                  (0xFFu << GPIO_PID7_PID7_Pos)                  /**< (GPIO_PID7)  Mask */
#define GPIO_PID7_PID7(value)               (GPIO_PID7_PID7_Msk & ((value) << GPIO_PID7_PID7_Pos))
#define GPIO_PID7_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID7) Register MASK  (Use GPIO_PID7_Msk instead)  */
#define GPIO_PID7_Msk                       0xFFu                                          /**< (GPIO_PID7) Register Mask  */

/* -------- GPIO_PID0 : (GPIO Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID0_OFFSET                    0xFE0                                         /**<  (GPIO_PID0) Peripheral ID Register 0  Offset */
#define GPIO_PID0_RESETVALUE                0x20u                                         /**<  (GPIO_PID0) Peripheral ID Register 0  Reset Value */

#define GPIO_PID0_PART_NUMBER_Pos           0                                              /**< (GPIO_PID0) Part Number Bits 7:0 Position */
#define GPIO_PID0_PART_NUMBER_Msk           (0xFFu << GPIO_PID0_PART_NUMBER_Pos)           /**< (GPIO_PID0) Part Number Bits 7:0 Mask */
#define GPIO_PID0_PART_NUMBER(value)        (GPIO_PID0_PART_NUMBER_Msk & ((value) << GPIO_PID0_PART_NUMBER_Pos))
#define GPIO_PID0_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID0) Register MASK  (Use GPIO_PID0_Msk instead)  */
#define GPIO_PID0_Msk                       0xFFu                                          /**< (GPIO_PID0) Register Mask  */

/* -------- GPIO_PID1 : (GPIO Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Bits 3:0                       */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

