remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
#define GPIO_PID1_OFFSET                    0xFE4                                         /**<  (GPIO_PID1) Peripheral ID Register 1  Offset */
#define GPIO_PID1_RESETVALUE                0xB8u                                         /**<  (GPIO_PID1) Peripheral ID Register 1  Reset Value */

#define GPIO_PID1_PART_NUMBER_Pos           0                                              /**< (GPIO_PID1) Part Number Bits 11:8 Position */
#define GPIO_PID1_PART_NUMBER_Msk           (0xFu << GPIO_PID1_PART_NUMBER_Pos)            /**< (GPIO_PID1) Part Number Bits 11:8 Mask */
#define GPIO_PID1_PART_NUMBER(value)        (GPIO_PID1_PART_NUMBER_Msk & ((value) << GPIO_PID1_PART_NUMBER_Pos))
#define GPIO_PID1_JEP106_ID_3_0_Pos         4                                              /**< (GPIO_PID1) JEP106 ID Bits 3:0 Position */
#define GPIO_PID1_JEP106_ID_3_0_Msk         (0xFu << GPIO_PID1_JEP106_ID_3_0_Pos)          /**< (GPIO_PID1) JEP106 ID Bits 3:0 Mask */
#define GPIO_PID1_JEP106_ID_3_0(value)      (GPIO_PID1_JEP106_ID_3_0_Msk & ((value) << GPIO_PID1_JEP106_ID_3_0_Pos))
#define GPIO_PID1_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID1) Register MASK  (Use GPIO_PID1_Msk instead)  */
#define GPIO_PID1_Msk                       0xFFu                                          /**< (GPIO_PID1) Register Mask  */

/* -------- GPIO_PID2 : (GPIO Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Bits 6:4                       */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID2_OFFSET                    0xFE8                                         /**<  (GPIO_PID2) Peripheral ID Register 2  Offset */
#define GPIO_PID2_RESETVALUE                0x1Bu                                         /**<  (GPIO_PID2) Peripheral ID Register 2  Reset Value */

#define GPIO_PID2_JEP106_ID_6_4_Pos         0                                              /**< (GPIO_PID2) JEP106 ID Bits 6:4 Position */
#define GPIO_PID2_JEP106_ID_6_4_Msk         (0x7u << GPIO_PID2_JEP106_ID_6_4_Pos)          /**< (GPIO_PID2) JEP106 ID Bits 6:4 Mask */
#define GPIO_PID2_JEP106_ID_6_4(value)      (GPIO_PID2_JEP106_ID_6_4_Msk & ((value) << GPIO_PID2_JEP106_ID_6_4_Pos))
#define GPIO_PID2_JEDEC_USED_Pos            3                                              /**< (GPIO_PID2) JEDEC Used Position */
#define GPIO_PID2_JEDEC_USED_Msk            (0x1u << GPIO_PID2_JEDEC_USED_Pos)             /**< (GPIO_PID2) JEDEC Used Mask */
#define GPIO_PID2_JEDEC_USED                GPIO_PID2_JEDEC_USED_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use GPIO_PID2_JEDEC_USED_Msk instead */
#define GPIO_PID2_REVISION_Pos              4                                              /**< (GPIO_PID2) Revision Position */
#define GPIO_PID2_REVISION_Msk              (0xFu << GPIO_PID2_REVISION_Pos)               /**< (GPIO_PID2) Revision Mask */
#define GPIO_PID2_REVISION(value)           (GPIO_PID2_REVISION_Msk & ((value) << GPIO_PID2_REVISION_Pos))
#define GPIO_PID2_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID2) Register MASK  (Use GPIO_PID2_Msk instead)  */
#define GPIO_PID2_Msk                       0xFFu                                          /**< (GPIO_PID2) Register Mask  */

/* -------- GPIO_PID3 : (GPIO Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PID3_OFFSET                    0xFEC                                         /**<  (GPIO_PID3) Peripheral ID Register 3  Offset */
#define GPIO_PID3_RESETVALUE                0x00u                                         /**<  (GPIO_PID3) Peripheral ID Register 3  Reset Value */

#define GPIO_PID3_CUSTOMER_MOD_NUMBER_Pos   0                                              /**< (GPIO_PID3) Customer Modification Number Position */
#define GPIO_PID3_CUSTOMER_MOD_NUMBER_Msk   (0xFu << GPIO_PID3_CUSTOMER_MOD_NUMBER_Pos)    /**< (GPIO_PID3) Customer Modification Number Mask */
#define GPIO_PID3_CUSTOMER_MOD_NUMBER(value) (GPIO_PID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << GPIO_PID3_CUSTOMER_MOD_NUMBER_Pos))
#define GPIO_PID3_ECO_REV_NUMBER_Pos        4                                              /**< (GPIO_PID3) ECO Revision Number Position */
#define GPIO_PID3_ECO_REV_NUMBER_Msk        (0xFu << GPIO_PID3_ECO_REV_NUMBER_Pos)         /**< (GPIO_PID3) ECO Revision Number Mask */
#define GPIO_PID3_ECO_REV_NUMBER(value)     (GPIO_PID3_ECO_REV_NUMBER_Msk & ((value) << GPIO_PID3_ECO_REV_NUMBER_Pos))
#define GPIO_PID3_MASK                      0xFFu                                          /**< \deprecated (GPIO_PID3) Register MASK  (Use GPIO_PID3_Msk instead)  */
#define GPIO_PID3_Msk                       0xFFu                                          /**< (GPIO_PID3) Register Mask  */

/* -------- GPIO_CID0 : (GPIO Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID0:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_CID0_OFFSET                    0xFF0                                         /**<  (GPIO_CID0) Component ID Register 0  Offset */
#define GPIO_CID0_RESETVALUE                0x0Du                                         /**<  (GPIO_CID0) Component ID Register 0  Reset Value */

#define GPIO_CID0_CID0_Pos                  0                                              /**< (GPIO_CID0)  Position */
#define GPIO_CID0_CID0_Msk                  (0xFFu << GPIO_CID0_CID0_Pos)                  /**< (GPIO_CID0)  Mask */
#define GPIO_CID0_CID0(value)               (GPIO_CID0_CID0_Msk & ((value) << GPIO_CID0_CID0_Pos))
#define GPIO_CID0_MASK                      0xFFu                                          /**< \deprecated (GPIO_CID0) Register MASK  (Use GPIO_CID0_Msk instead)  */
#define GPIO_CID0_Msk                       0xFFu                                          /**< (GPIO_CID0) Register Mask  */

/* -------- GPIO_CID1 : (GPIO Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID1:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

