remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
#define GPIO_CID1_OFFSET                    0xFF4                                         /**<  (GPIO_CID1) Component ID Register 1  Offset */
#define GPIO_CID1_RESETVALUE                0xF0u                                         /**<  (GPIO_CID1) Component ID Register 1  Reset Value */

#define GPIO_CID1_CID1_Pos                  0                                              /**< (GPIO_CID1)  Position */
#define GPIO_CID1_CID1_Msk                  (0xFFu << GPIO_CID1_CID1_Pos)                  /**< (GPIO_CID1)  Mask */
#define GPIO_CID1_CID1(value)               (GPIO_CID1_CID1_Msk & ((value) << GPIO_CID1_CID1_Pos))
#define GPIO_CID1_MASK                      0xFFu                                          /**< \deprecated (GPIO_CID1) Register MASK  (Use GPIO_CID1_Msk instead)  */
#define GPIO_CID1_Msk                       0xFFu                                          /**< (GPIO_CID1) Register Mask  */

/* -------- GPIO_CID2 : (GPIO Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID2:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_CID2_OFFSET                    0xFF8                                         /**<  (GPIO_CID2) Component ID Register 2  Offset */
#define GPIO_CID2_RESETVALUE                0x05u                                         /**<  (GPIO_CID2) Component ID Register 2  Reset Value */

#define GPIO_CID2_CID2_Pos                  0                                              /**< (GPIO_CID2)  Position */
#define GPIO_CID2_CID2_Msk                  (0xFFu << GPIO_CID2_CID2_Pos)                  /**< (GPIO_CID2)  Mask */
#define GPIO_CID2_CID2(value)               (GPIO_CID2_CID2_Msk & ((value) << GPIO_CID2_CID2_Pos))
#define GPIO_CID2_MASK                      0xFFu                                          /**< \deprecated (GPIO_CID2) Register MASK  (Use GPIO_CID2_Msk instead)  */
#define GPIO_CID2_Msk                       0xFFu                                          /**< (GPIO_CID2) Register Mask  */

/* -------- GPIO_CID3 : (GPIO Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID3:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} GPIO_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_CID3_OFFSET                    0xFFC                                         /**<  (GPIO_CID3) Component ID Register 3  Offset */
#define GPIO_CID3_RESETVALUE                0xB1u                                         /**<  (GPIO_CID3) Component ID Register 3  Reset Value */

#define GPIO_CID3_CID3_Pos                  0                                              /**< (GPIO_CID3)  Position */
#define GPIO_CID3_CID3_Msk                  (0xFFu << GPIO_CID3_CID3_Pos)                  /**< (GPIO_CID3)  Mask */
#define GPIO_CID3_CID3(value)               (GPIO_CID3_CID3_Msk & ((value) << GPIO_CID3_CID3_Pos))
#define GPIO_CID3_MASK                      0xFFu                                          /**< \deprecated (GPIO_CID3) Register MASK  (Use GPIO_CID3_Msk instead)  */
#define GPIO_CID3_Msk                       0xFFu                                          /**< (GPIO_CID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief GPIO hardware registers */
typedef struct {  /* GPIO Controller */
  RwReg16 DATA;           /**< (GPIO Offset: 0x00) Data Value */
  __I  uint8_t  Reserved1[2];
  RwReg16 DATAOUT;        /**< (GPIO Offset: 0x04) Data Output Register Value */
  __I  uint8_t  Reserved2[10];
  RwReg16 OUTENSET;       /**< (GPIO Offset: 0x10) Output Enable Set */
  __I  uint8_t  Reserved3[2];
  RwReg16 OUTENCLR;       /**< (GPIO Offset: 0x14) Output Enable Clear */
  __I  uint8_t  Reserved4[10];
  RwReg16 INTENSET;       /**< (GPIO Offset: 0x20) Interrupt Enable Set */
  __I  uint8_t  Reserved5[2];
  RwReg16 INTENCLR;       /**< (GPIO Offset: 0x24) Interrupt Enable Clear */
  __I  uint8_t  Reserved6[2];
  RwReg16 INTTYPESET;     /**< (GPIO Offset: 0x28) Interrupt Type Set */
  __I  uint8_t  Reserved7[2];
  RwReg16 INTTYPECLR;     /**< (GPIO Offset: 0x2C) Interrupt Type Clear */
  __I  uint8_t  Reserved8[2];
  RwReg16 INTPOLSET;      /**< (GPIO Offset: 0x30) Polarity-level, edge IRQ Configuration */
  __I  uint8_t  Reserved9[2];
  RwReg16 INTPOLCLR;      /**< (GPIO Offset: 0x34) IRQ Configuration Clear */
  __I  uint8_t  Reserved10[2];
  RwReg16 INTSTATUSCLEAR; /**< (GPIO Offset: 0x38) Interrupt Status */
  __I  uint8_t  Reserved11[3990];
  RoReg8  PID4;           /**< (GPIO Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved12[3];
  RoReg8  PID5;           /**< (GPIO Offset: 0xFD4) Peripheral ID Register 5 */
  __I  uint8_t  Reserved13[3];
  RoReg8  PID6;           /**< (GPIO Offset: 0xFD8) Peripheral ID Register 6 */
  __I  uint8_t  Reserved14[3];
  RoReg8  PID7;           /**< (GPIO Offset: 0xFDC) Peripheral ID Register 7 */
  __I  uint8_t  Reserved15[3];
  RoReg8  PID0;           /**< (GPIO Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved16[3];
  RoReg8  PID1;           /**< (GPIO Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved17[3];
  RoReg8  PID2;           /**< (GPIO Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved18[3];
  RoReg8  PID3;           /**< (GPIO Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved19[3];
  RoReg8  CID0;           /**< (GPIO Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved20[3];
  RoReg8  CID1;           /**< (GPIO Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved21[3];
  RoReg8  CID2;           /**< (GPIO Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved22[3];
  RoReg8  CID3;           /**< (GPIO Offset: 0xFFC) Component ID Register 3 */
} Gpio;

