remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/gpio.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief GPIO hardware registers */
typedef struct {  /* GPIO Controller */
  __IO GPIO_DATA_Type                 DATA;           /**< Offset: 0x00 (R/W  16) Data Value */
       RoReg8                         Reserved1[0x2];
  __IO GPIO_DATAOUT_Type              DATAOUT;        /**< Offset: 0x04 (R/W  16) Data Output Register Value */
       RoReg8                         Reserved2[0xA];
  __IO GPIO_OUTENSET_Type             OUTENSET;       /**< Offset: 0x10 (R/W  16) Output Enable Set */
       RoReg8                         Reserved3[0x2];
  __IO GPIO_OUTENCLR_Type             OUTENCLR;       /**< Offset: 0x14 (R/W  16) Output Enable Clear */
       RoReg8                         Reserved4[0xA];
  __IO GPIO_INTENSET_Type             INTENSET;       /**< Offset: 0x20 (R/W  16) Interrupt Enable Set */
       RoReg8                         Reserved5[0x2];
  __IO GPIO_INTENCLR_Type             INTENCLR;       /**< Offset: 0x24 (R/W  16) Interrupt Enable Clear */
       RoReg8                         Reserved6[0x2];
  __IO GPIO_INTTYPESET_Type           INTTYPESET;     /**< Offset: 0x28 (R/W  16) Interrupt Type Set */
       RoReg8                         Reserved7[0x2];
  __IO GPIO_INTTYPECLR_Type           INTTYPECLR;     /**< Offset: 0x2C (R/W  16) Interrupt Type Clear */
       RoReg8                         Reserved8[0x2];
  __IO GPIO_INTPOLSET_Type            INTPOLSET;      /**< Offset: 0x30 (R/W  16) Polarity-level, edge IRQ Configuration */
       RoReg8                         Reserved9[0x2];
  __IO GPIO_INTPOLCLR_Type            INTPOLCLR;      /**< Offset: 0x34 (R/W  16) IRQ Configuration Clear */
       RoReg8                         Reserved10[0x2];
  __IO GPIO_INTSTATUSCLEAR_Type       INTSTATUSCLEAR; /**< Offset: 0x38 (R/W  16) Interrupt Status */
       RoReg8                         Reserved11[0xF96];
  __I  GPIO_PID4_Type                 PID4;           /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved12[0x3];
  __I  GPIO_PID5_Type                 PID5;           /**< Offset: 0xFD4 (R/    8) Peripheral ID Register 5 */
       RoReg8                         Reserved13[0x3];
  __I  GPIO_PID6_Type                 PID6;           /**< Offset: 0xFD8 (R/    8) Peripheral ID Register 6 */
       RoReg8                         Reserved14[0x3];
  __I  GPIO_PID7_Type                 PID7;           /**< Offset: 0xFDC (R/    8) Peripheral ID Register 7 */
       RoReg8                         Reserved15[0x3];
  __I  GPIO_PID0_Type                 PID0;           /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved16[0x3];
  __I  GPIO_PID1_Type                 PID1;           /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved17[0x3];
  __I  GPIO_PID2_Type                 PID2;           /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved18[0x3];
  __I  GPIO_PID3_Type                 PID3;           /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved19[0x3];
  __I  GPIO_CID0_Type                 CID0;           /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved20[0x3];
  __I  GPIO_CID1_Type                 CID1;           /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved21[0x3];
  __I  GPIO_CID2_Type                 CID2;           /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved22[0x3];
  __I  GPIO_CID3_Type                 CID3;           /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} Gpio;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_GPIO_COMPONENT_ */
